<?php
//-----------------------------------------------------------------------------------------
// 프로그램		: RINT-KIT
// 제작			: 린트킷(rintkit.com)
// 버전			: 1.0
// 인코딩		: UTF-8
// 설명			: RTBOARD Info theme config
//-----------------------------------------------------------------------------------------

if (defined('RINTKIT') === FALSE) { exit('잘못된 경로입니다.'); }

//-------------------------------------------------------------------------------------------------

//기능 페이지 정의(func)
$_cfg_use_func = array("list","view");

//권한 요소 정의(auth)
$_cfg_use_auth = array("list","read","comment");
?>