<?php
//-----------------------------------------------------------------------------------------
// 프로그램		: RINT-KIT
// 제작			: 린트킷(rintkit.com)
// 버전			: 1.0
// 인코딩		: UTF-8
// 설명			: 관리자 모드 전용 기본 포함 파일
//-----------------------------------------------------------------------------------------

/**
 * 관리자 기본 엔진
 */

//APP Admin 연동 시 중복 Include 방지 처리
if (defined('RINTKIT') === FALSE) {
	require_once $_SERVER['DOCUMENT_ROOT']."/_x_signpost.php";
}

//-------------------------------------------------------------------------------------------------

/**
 * 관리자 접근 제한
 */

rt_load_component("ipcheck");

$user_ip = $env->_server['REMOTE_ADDR'];
if (empty($user_ip)) {exit;} else {
	$cls_Ip = new ipcheck($user_ip);
}

//-------------------------------------------------------------------------------------------------

/**
 * URI 데이터 분리
 */

$_div_url = explode("/", $env->_server['REQUEST_URI']);
$_add_dir_cnt = explode("/", RTW_ROOT);

if (count($_add_dir_cnt) > 1) {
	$_div_url_cnt = count($_add_dir_cnt) + 1;
} else {
	$_div_url_cnt = 2;
}


//-------------------------------------------------------------------------------------------------

/**
 * 서비스 디렉토리 & 실행 파일 설정
 *
 * __dr : 서비스 디렉토리
 *
 * __sd : 서비스 내 섹션 전체 디렉토리
 *        하위 디렉토리는 대시(-)로 구분하여 전달
 *        ex) ?sd=master-master2-master3&cf=view
 *
 * __sc : 실행할 섹션 내 디렉토리
 *        $__sd로 전달된 변수 중 마지막 디렉토리명
 *
 * __cf : 컨트롤 파일
 */


//1.서비스 디렉토리
$__dr = $_div_url[$_div_url_cnt];

//2.서비스 내 섹션 전체 디렉토리 (하위 포함)
if (empty($env->_get['sd'])) {
	$__sd = $__dr;
} else {
	$__sd = str_replace("-", "/", $env->_get['sd']);
}

//3.실행할 섹션 내 디렉토리
$__sd_arr = explode("/", $__sd);
$__sd_arr_cnt = count($__sd_arr) - 1;
$__sc = $__sd_arr[$__sd_arr_cnt];

//4.컨트롤 파일
if (empty($env->_get['cf'])) {
	$__cf = $__sc;
} else {
	$__cf = $env->_get['cf'];
}

//-------------------------------------------------------------------------------------------------

/**
 * 관리자 계정관리 컨트롤러
 */

require_once RT_ADM."/account/controller/account.controller.php";

$cls_adm = new adm_account();

//-------------------------------------------------------------------------------------------------

/**
 * 관리자 세션 체크
 */

if (!$cls_adm->is_login()) {

	if ($__dr != "login") {
		rt_js_move("", "parent", "href", RTW_ADM."/login/");
		exit;
	}
}

//-------------------------------------------------------------------------------------------------
?>