<?
//-------------------------------------------------------------------------------------------------
/*
 * 마스터 계정 데이터 세팅
 */
//-------------------------------------------------------------------------------------------------

if (defined('RINTKIT') === FALSE) { exit('잘못된 경로입니다.'); }

//네비게이션 데이터
$__cfg = array();
$__cfg['nav'][0] = "계정관리";
$__cfg['nav'][1] = "마스터 계정";
$__cfg['nav'][2] = "정보 수정";


//마스터 계정정보 세팅
$_r = $dbo->fetch("SELECT * FROM ".$cls_adm->db_tbl." WHERE auth_code='master'");
?>