<?php
//-------------------------------------------------------------------------------------------------
/*
 * 페이지 강제 포워딩
 */
//-------------------------------------------------------------------------------------------------

if (defined('RINTKIT') === FALSE) { exit('잘못된 경로입니다.'); }


//네비게이션 데이터
$__cfg = array();
$__cfg['nav'][0] = "페이지 관리";

switch ($__cf)
{
	case "try404":
		$__cfg['nav'][1] = "404 요청 URL";

		//매칭 데이터
		$_r = $dbo->fetch_list("SELECT * FROM RT_PAGE_404");

	break;
}

$__sub_title = "y";
$__cfg['page'] = $__cfg['nav'][0]." <span style='color:#999999;'> | ".$__cfg['nav'][1]."</span>";
?>